schedule1 = {
    "ПН": [
        {"time": "8:00-8:45", "subject": "Основы управления интеллектуальной собственностью", "room": "453", "teacher": "Лесницкая В. А.","frame": "1", "type": "Лекция"},
        {"time": "8:50-9:35", "subject": "Оргнанизация и управление предприятием(производством)", "room": "307", "teacher": "Барсуков А. А.","frame": "1", "type":},        
        {"time": "9:55-11:30", "subject": "Оргнанизация и управление предприятием(производством)", "room": "312", "teacher": "Барсуков А. А.","frame": "1", "type": ""},
        {"time": "11:40-12:25", "subject": "Защита населения", "room": "508", "teacher": "Тавгень Т. А.","frame": "18", "type": ""},
    ],
    "ВТ": [
    ],
    "СР": [
        {"time": "14:15-15:50", "subject": "сорянчик, бот еще не готов, я не понимаю расписание(((", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": ""},
        {"time": "16:00-17:35", "subject": "если кто-то может объяснить/ответить на пару вопросов буду очень благодарен", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": ""},
    ],
    "ЧТ": [
        {"time": "8:00-9:35", "subject": "Основы управления интеллектуальной собственностью", "room": "363", "teacher": "Лесницкая В. А.","frame": "1", "type": ""},
        {"time": "13:55-15:30", "subject": "Экономика предприятия", "room": "302", "teacher": "Самусенко Л. А.","frame": "9", "type": ""},
    ],
    "ПТ": [
        {"time": "10:25-12:00", "subject": "Информационно-коммуникационные технологии в образовании", "room": "301", "teacher": "Малиновская Д. А.","frame": "20", "type": ""},
        {"time": "18:05-19:40", "subject": "Программные средства создания Интернет-приложений", "room": "304", "teacher": "Василевская В. А.","frame": "20", "type": ""},
    ],
    "СБ": [
        {"time": "12:10-13:45", "subject": "Верификация и аттестация ПО", "room": "303", "teacher": "Гала Е. В.","frame": "20", "type": ""},
        {"time": "14:15-15:50", "subject": "Верификация и аттестация ПО", "room": "303", "teacher": "Гала Е. В.","frame": "20", "type": ""},
    ],
}

schedule2 = {
    "ПН": [
        {"time": "8:00-9:35", "subject": "Организация и управление предприятием (производством)", "room": "307", "teacher": "Барсуков А. А.","frame": "1", "type": ""},
        {"time": "11:40-13:15", "subject": "Защита населения", "room": "508", "teacher": "Тавгень Т. А.","frame": "18", "type": ""},
    ],
    "ВТ": [
    ],
    "СР": [
        {"time": "14:15-15:50", "subject": "сорянчик, бот еще не готов, я не понимаю расписание(((", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": ""},
        {"time": "16:00-17:35", "subject": "если кто-то может объяснить/ответить на пару вопросов буду очень благодарен", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": ""},
    ],
    "ЧТ": [
        {"time": "8:00-9:35", "subject": "Основы управления интеллектуальной собственностью", "room": "363", "teacher": "Лесницкая В. А.","frame": "1", "type": ""},
        {"time": "13:55-15:30", "subject": "Экономика предприятия", "room": "302", "teacher": "Самусенко Л. А.","frame": "9", "type": ""},
    ],
    "ПТ": [
        {"time": "10:25-12:00", "subject": "Информационно-коммуникационные технологии в образовании", "room": "301", "teacher": "Малиновская Д. А.","frame": "20", "type": ""},
        {"time": "18:05-19:40", "subject": "Программные средства создания Интернет-приложений", "room": "304", "teacher": "Василевская В. А.","frame": "20", "type": ""},
    ],
    "СБ": [
        {"time": "12:10-13:45", "subject": "Программные средства создания Интернет-приложений", "room": "304", "teacher": "Василевская В. А.","frame": "20", "type": ""},
        {"time": "14:15-15:50", "subject": "Программные средства создания Интернет-приложений", "room": "304", "teacher": "Василевская В. А.","frame": "20", "type": ""},
    ],
}
