schedule1 = {
    "ПН": [
        {"time": "14:15-15:50", "subject": "Компьютерные сети", "room": "601", "teacher": "Павловская К. В.","frame": "20", "type": "лекционное занятие"},
        {"time": "16:00-17:35", "subject": "Белорусский язык(профессиональная лексика)", "room": "404", "teacher": "Метельский А. А.","frame": "20", "type": "практическое занятие"},
    ],
    "ВТ": [
        {"time": "12:10-13:45", "subject": "Базы данных", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Физическая культура", "room": "-", "teacher": "Миклашевич Е. Ю., Анцыпорович Н. П.","frame": "15", "type": "-"},
        {"time": "16:00-17:35", "subject": "Основы автоматизированного проектирования", "room": "303", "teacher": "Азаров С. М.","frame": "20", "type": "лабораторное занятие"},
    ],
    "СР": [
        {"time": "14:15-15:50", "subject": "Методика обучения в учереждениях профессионального образования", "room": "308", "teacher": "Зуёнок А. Ю.","frame": "20", "type": "лекционное занятие"},
        {"time": "16:00-17:35", "subject": "Профессиональная педагогика", "room": "308", "teacher": "Зуёнок А. Ю.", "frame": "20", "type": "лекционное занятие"},
    ],
    "ЧТ": [
        {"time": "8:30-10:05", "subject": "Базы данных", "room": "303", "teacher": "Ковалевич А. А.","frame": "20", "type": "лабораторное занятие"},
        {"time": "10:25-12:00", "subject": "Компьютерные системы и сети", "room": "303", "teacher": "Ковалевич А. А.","frame": "20", "type": "лабораторное занятие"},
        {"time": "12:10-13:45", "subject": "Веб-дизайн шаблоны проектирования", "room": "301", "teacher": "Василевская В. А.","frame": "20", "type": "лабораторное занятие"},
        {"time": "14:15-15:50", "subject": "Веб-дизайн шаблоны проектирования", "room": "308", "teacher": "Астапчик Н. И.","frame": "20", "type": "лекционное занятие"},
    ],
    "ПТ": [
        {"time": "12:10-13:45", "subject": "Базы данных", "room": "408", "teacher": "Михасик Е. И.","frame": "20", "type": "курсовой проект"},
        {"time": "14:15-15:50", "subject": "Физическая культура", "room": "-", "teacher": "Миклашевич Е. Ю., Анцыпорович Н. П.","frame": "15", "type": "-"},
        {"time": "16:00-17:35", "subject": "Базы данных", "room": "404", "teacher": "Михасик Е. И.","frame": "20", "type": "практическое занятие"},
        {"time": "17:45-19:20", "subject": "Методика обучения в учереждениях профессионального образования", "room": "301", "teacher": "Зуёнок А. Ю.","frame": "20", "type": "практическое занятие"},
    ],
    "СБ": [
        {"time": "10:25-12:00", "subject": "Инструменты и средства программирования", "room": "301", "teacher": "Малиновская Д.А","frame": "20", "type": "лабораторная занятие"},
        {"time": "12:10-13:45", "subject": "Профессиональная педагогика", "room": "308", "teacher": "Малиновская Д.А","frame": "20", "type": "практическое занятие"},
        
    ],
}

schedule2 = {
    "ПН": [
        {"time": "12:10-13:45", "subject": "Инструменты и средства программирования", "room": "308", "teacher": "Астачик Н. И.","frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Компьютерные сети", "room": "601", "teacher": "Павловская К. В.","frame": "20", "type": "лекционное занятие"},
        {"time": "16:00-17:35", "subject": "Белорусский язык(профессиональная лексика)", "room": "404", "teacher": "Метельский А. А.","frame": "20", "type": "практическое занятие"},
    ],
    "ВТ": [
        {"time": "12:10-13:45", "subject": "Базы данных", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Физическая культура", "room": "-", "teacher": "Миклашевич Е. Ю., Анцыпорович Н. П.","frame": "15", "type": "-"},
        {"time": "16:00-17:35", "subject": "Основы автоматизированного проектирования", "room": "303", "teacher": "Азаров С. М.","frame": "20", "type": "лабораторная работа"},
    ],
    "СР": [
        {"time": "14:15-15:50", "subject": "Методика обучения в учереждениях профессионального образования", "room": "308", "teacher": "Зуёнок А. Ю.","frame": "20", "type": "лекционное занятие"},
        {"time": "16:00-17:35", "subject": "Профессиональная педагогика", "room": "308", "teacher": "Зуёнок А. Ю.", "frame": "20", "type": "лекционное занятие"},
    ],
    "ЧТ": [
        {"time": "8:30-10:05", "subject": "Базы данных", "room": "303", "teacher": "Ковалевич А. А.","frame": "20", "type": "лабораторное занятие"},
        {"time": "10:25-12:00", "subject": "Компьютерные системы и сети", "room": "303", "teacher": "Ковалевич А. А.","frame": "20", "type": "лабораторное занятие"},
        {"time": "12:10-13:45", "subject": "Веб-дизайн шаблоны проектирования", "room": "301", "teacher": "Василевская В. А.","frame": "20", "type": "лабораторное занятие"},
        {"time": "14:15-15:50", "subject": "Веб-дизайн шаблоны проектирования", "room": "308", "teacher": "Астапчик Н. И.","frame": "20", "type": "лекционное занятие"},
    ],
    "ПТ": [
        {"time": "12:10-13:45", "subject": "Методика обучения в учереждениях профессионального образования", "room": "404", "teacher": "Зуёнок А. Ю.","frame": "20", "type": "курсовая работа"},
        {"time": "14:15-15:50", "subject": "Физическая культура", "room": "-", "teacher": "Миклашевич Е. Ю., Анцыпорович Н. П.","frame": "15", "type": "-"},
        {"time": "16:00-17:35", "subject": "Базы данных", "room": "404", "teacher": "Михасик Е. И.","frame": "20", "type": "практическое занятие"},
        {"time": "17:45-19:20", "subject": "Методика обучения в учереждениях профессионального образования", "room": "301", "teacher": "Зуёнок А. Ю.","frame": "20", "type": "практическое занятие"},
    ],
    "СБ": [
        {"time": "10:25-12:00", "subject": "Инструменты и средства программирования", "room": "301", "teacher": "Малиновская Д.А","frame": "20", "type": "лабораторная занятие"},
        {"time": "12:10-13:45", "subject": "Профессиональная педагогика", "room": "308", "teacher": "Малиновская Д.А","frame": "20", "type": "практическое занятие"},
    ],
}
