schedule1 = {
    "ПН": [
        {"time": "8:00-9:35", "subject": "Основы управления интеллектуальной собственностью", "room": "453", "teacher": "Лесницкая В. А.","frame": "1", "type": "Лекция"},        
        {"time": "9:55-11:30", "subject": "Оргнанизация и управление предприятием(производством)", "room": "312", "teacher": "Барсуков А. А.","frame": "1", "type": "Лекция"},
        {"time": "11:40-13:15", "subject": "Защита населения", "room": "508", "teacher": "Тавгень Т. А.","frame": "18", "type": ""},
    ],
    "ВТ": [
    ],
    "СР": [
        {"time": "14:15-15:50", "subject": "Основы интернета вещей", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": ""},
        {"time": "16:00-17:35", "subject": "основы интернета вещей", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": ""},
    ],
    "ЧТ": [
        {"time": "8:00-9:35", "subject": "Основы управления интеллектуальной собственностью", "room": "363", "teacher": "Лесницкая В. А.","frame": "1", "type": ""},
        {"time": "9:55-11:30", "subject": "Защита населения и объектов в чрезвычайных ситуациях. Радиационная безопасность", "room": "502", "teacher": "Морзак Г. И.","frame": "18", "type": "Лекция"},
        {"time": "11:40-13:15", "subject": "Экономика предприятия", "room": "437", "teacher": "Комина Н. В.","frame": "1", "type": ""},
        {"time": "13:55-15:30", "subject": "Экономика предприятия", "room": "302", "teacher": "Самусенко Л. А.","frame": "9", "type": ""},
    ],
    "ПТ": [
        {"time": "14:15-15:50", "subject": "Информационно-коммуникативные технологии в образовании", "room": "601", "teacher": "Евтухова Т. Е.","frame": "20", "type": "Лекция"},
        {"time": "19:50-21:25", "subject": "Информационно-коммуникативные технологии в образовании", "room": "301", "teacher": "Малиновска Д. А.","frame": "20", "type": ""},
    ],
    "СБ": [
        {"time": "12:10-13:45", "subject": "Верификация и аттестация ПО", "room": "303", "teacher": "Гала Е. В.","frame": "20", "type": ""},
        {"time": "14:15-15:50", "subject": "Верификация и аттестация ПО", "room": "303", "teacher": "Гала Е. В.","frame": "20", "type": ""},
    ],
}

schedule2 = {
    "ПН": [
        {"time": "8:00-9:35", "subject": "Организация и управление предприятием (производством)", "room": "307", "teacher": "Барсуков А. А.","frame": "1", "type": ""},
        {"time": "9:55-11:30", "subject": "Оргнанизация и управление предприятием(производством)", "room": "312", "teacher": "Барсуков А. А.","frame": "1", "type": "Лекция"},
    ],
    "ВТ": [
    ],
    "СР": [
        {"time": "14:15-15:50", "subject": "Программные средства создания Интернет-приложений", "room": "308", "teacher": "Астапчик Н. И.","frame": "20", "type": "Лекция"},
        {"time": "16:00-17:35", "subject": "Основы интернета вещей", "room": "308", "teacher": "Михасик Е. И.","frame": "20", "type": "Лекция"},
    ],
    "ЧТ": [
        
        {"time": "9:55-11:30", "subject": "Защита населения и объектов в чрезвычайных ситуациях. Радиационная безопасность", "room": "512", "teacher": "Морзак Г. И.","frame": "18", "type": "Лекция"},
        {"time": "11:40-13:15", "subject": "Экономика предприятия", "room": "437", "teacher": "Комина Н. В.","frame": "1", "type": ""},
        {"time": "13:55-15:30", "subject": "Экономика предприятия", "room": "453", "teacher": "Самусенко Л. А.","frame": "1", "type": ""},
    ],
    "ПТ": [
        {"time": "12:10-13:45", "subject": "Верификация и аттестация ПО", "room": "601", "teacher": "Павловская К. В.","frame": "20", "type": "Лекция"},
        {"time": "14:15-15:50", "subject": "Программные средства созания Интрернет-приложений", "room": "601", "teacher": "Астапчик Н. И.","frame": "20", "type": "Лекция"},
        {"time": "19:50-21:25", "subject": "Программные средства создания Интернет-приложений", "room": "301", "teacher": "Малиновская Д. А.","frame": "20", "type": ""},
    ],
    "СБ": [
        {"time": "12:10-13:45", "subject": "Программные средства создания Интернет-приложений", "room": "304", "teacher": "Василевская В. А.","frame": "20", "type": ""},
        {"time": "14:15-15:50", "subject": "Программные средства создания Интернет-приложений", "room": "304", "teacher": "Василевская В. А.","frame": "20", "type": ""},
    ],
}
