schedule = {
    "Понедельник": [
        {"time": "12:10-13:45", "subject": "Методика обучения в учреждения ПО", "room": "406", "teacher": "Зуенок А.Ю.","frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Физкультура", "room": "-", "teacher": "Миклашевич Е.Ю., Ахрем Н.П.","frame": "15", "type": ""},
        {"time": "16:00-17:35", "subject": "Базы данных", "room": "303", "teacher": "Ковалевич А.А.","frame": "20", "type": "практическое занятие"},
        {"time": "17:45-19:20", "subject": "Отладка и тестирование ПО", "room": "301", "teacher": "Павловская К.В","frame": "20", "type": "практическое занятие"},
    ],
    "Вторник": [
        {"time": "12:10-13:45", "subject": "Базы данных", "room": "601", "teacher": "Астапчик Н.И.","frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Методика воспитательной работы в учреждениях профессионального образования", "room": "601", "teacher": "Каминская Т.С.","frame": "20", "type": "лекционное занятие"},
        {"time": "16:00-17:35", "subject": "Методика обучения", "room": "304", "teacher": "Малиновская Д.А.","frame": "20", "type": "практическое занятие"},
        {"time": "17:45-19:20", "subject": "Современные платформы программирования", "room": "303", "teacher": "Малиновская Д.А.","frame": "20", "type": "практическое занятие"},
    ],
    "Среда": [
        {"time": "10:25-12:00", "subject": "Организационно-методические основы", "room": "404", "teacher": "Гурина Е.А.", "frame": "20", "type": "лекционное занятие"},
        {"time": "12:10-13:45", "subject": "Организационно-методические основы профессионального обучения", "room": "601", "teacher": "Гурина Е.А", "frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Отладка и тестирование ПО", "room": "403", "teacher": "Павловская К.В","frame": "20", "type": "практическое занятие"},
        {"time": "16:00-17:35", "subject": "Инструменты и средства программирования", "room": "303", "teacher": "Малиновская Д.А.", "frame": "20", "type": "практическое занятие"},
    ],
    "Четверг": [
        {"time": "10:25-12:00", "subject": "Современные языки программирования КП", "room": "606", "teacher": "Михасик Е.И.","frame": "20", "type": "практическое занятие"},
        {"time": "12:10-13:45", "subject": "Современные платформы программирования", "room": "601", "teacher": "Михасик Е.И.","frame": "20", "type": "лекционное занятие"},
        {"time": "14:15-15:50", "subject": "Физкультура (Факультатив)", "room": "-", "teacher": "Миклашевич Е.Ю., Ахрем Н.П.","frame": "15", "type": ""},
    ],
    "Пятница": [
        {"time": "12:10-13:45", "subject": "Методика воспитательной работы", "room": "406", "teacher": "Каминская Т.С.","frame": "20", "type": "практическое занятие"},
        {"time": "14:15-15:50", "subject": "Современные языки программирования", "room": "403", "teacher": "Дробыш А.А.","frame": "20", "type": "лекционное занятие"},
    ],
    "Суббота": [
        {"time": "10:25-12:00", "subject": "Современные языки программирования", "room": "303", "teacher": "Малиновская Д.А","frame": "20", "type": "практическое занятие"},
        {"time": "12:10-13:45", "subject": "Современные языки программирования", "room": "303", "teacher": "Малиновская Д.А","frame": "20", "type": "практическое занятие"},
    ],
}
